Revit 2026 API

# MultiReferenceAnnotationTypeIsAllowedTagType Method

---

Checks if the tag type can be assigned to this multi-reference annotation type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAllowedTagType(
	ElementId tagTypeId
)
```
```vb
Public Function IsAllowedTagType (
	tagTypeId As ElementId
) As Boolean
```
```cpp
public:
bool IsAllowedTagType(
	ElementId^ tagTypeId
)
```
```fsharp
member IsAllowedTagType :
        tagTypeId : ElementId -> bool
```

#### Parameters

tagTypeId ElementId
     The tag type to test.

#### Return Value

Boolean True if the tag type exclusively tags elements from the multi-reference annotation's reference category.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only tag types which exclusively tag elements from the multi-reference annotation's reference category can be used.

#### Reference

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace